Учет_ФК/src/Documents/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукции</name>
  <registerRecords>AccumulationRegister.ВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПродукцииНаСкладе</registerRecords>
  <registerRecords>InformationRegister.ДанныеЗатаркиТранспортировочныхМест</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницыТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТранспортировочныеМеста</name>
    <attributes>
      <name>ТранспортировочноеМесто</name>
      <type>
        <types>CatalogRef.ТранспортировочныеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоСухой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПломбы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерМестаВПартии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_ФК/src/InformationRegisters/ДанныеЗатаркиТранспортировочныхМест/ДанныеЗатаркиТранспортировочныхМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеЗатаркиТранспортировочныхМест</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерМеста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоСухой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТранспортировочноеМесто</name>
    <type>
      <types>CatalogRef.ТранспортировочныеМеста</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_ФК/src/AccumulationRegisters/ОстаткиПродукцииНаСкладе/ОстаткиПродукцииНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПродукцииНаСкладе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоСухой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПартияПродукции</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортировочноеМесто</name>
    <type>
      <types>CatalogRef.ТранспортировочныеМеста</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеХраниния</name>
    <type>
      <types>EnumRef.СостоянияХранения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учет_ФК/src/AccumulationRegisters/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыпускПродукции</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоСухой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестВПартии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПартияПродукции</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учет_ФК/src/Enums/СостоянияХранения/СостоянияХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияХранения</name>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>Транспортировка</name>
  </enumValues>
  <enumValues>
    <name>ХранениеНекондиции</name>
  </enumValues>
</mdclass:Enum>

Учет_ФК/src/Documents/ВыпускПродукции/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ДанныеЗатаркиТранспортировочныхМест.Записывать = Истина;
	Для Каждого ТекСтрокаТранспортировочныеМеста Из ТранспортировочныеМеста Цикл
		Движение = Движения.ДанныеЗатаркиТранспортировочныхМест.Добавить();
		Движение.ТранспортировочноеМесто = ТекСтрокаТранспортировочныеМеста.ТранспортировочноеМесто;
		Движение.Партия = Партия;
		Движение.ВесБруттоВлажный = ТекСтрокаТранспортировочныеМеста.ВесБруттоВлажный;
		Движение.ВесНеттоВлажный = ТекСтрокаТранспортировочныеМеста.ВесНеттоВлажный;
		Движение.ВесНеттоСухой = ТекСтрокаТранспортировочныеМеста.ВесНеттоСухой;
		Движение.НомерПломбы = ТекСтрокаТранспортировочныеМеста.НомерПломбы;
		Движение.Влажность = Влажность;
		Движение.НомерМеста = ТекСтрокаТранспортировочныеМеста.НомерМестаВПартии;
	КонецЦикла;

	Движения.ОстаткиПродукцииНаСкладе.Записывать = Истина;
	Для Каждого ТекСтрокаТранспортировочныеМеста Из ТранспортировочныеМеста Цикл
		Движение = Движения.ОстаткиПродукцииНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Склад = Склад;
		Движение.ПартияПродукции = Партия;
		Движение.Номенклатура = Партия.Номенклатура;
		Движение.СостояниеХраниния = Перечисления.СостоянияХранения.Хранение;
		Движение.ТранспортировочноеМесто = ТекСтрокаТранспортировочныеМеста.ТранспортировочноеМесто;
		
		Движение.КоличествоМест 	= 1;
		Движение.Количество 		= ТекСтрокаТранспортировочныеМеста.ВесНеттоСухой;
		Движение.ВесНеттоСухой 		= ТекСтрокаТранспортировочныеМеста.ВесНеттоСухой;
		Движение.ВесНеттоВлажный 	= ТекСтрокаТранспортировочныеМеста.ВесНеттоВлажный;
		Движение.ВесБруттоВлажный 	= ТекСтрокаТранспортировочныеМеста.ВесБруттоВлажный;
		
	КонецЦикла;
	
	Движения.ВыпускПродукции.Записывать = Истина;
	Движение 					= Движения.ВыпускПродукции.Добавить();
	Движение.Активность 		= Истина;
	Движение.Период 			= Дата;
	Движение.Номенклатура 		= Партия.Номенклатура;
	Движение.Организация 		= Организация;
	Движение.ПартияПродукции 	= Партия;
	Движение.Количество 		= ТранспортировочныеМеста.Итог("ВесНеттоСухой");
	Движение.ВесНеттоСухой 		= ТранспортировочныеМеста.Итог("ВесНеттоСухой");
	Движение.ВесБруттоВлажный 	= ТранспортировочныеМеста.Итог("ВесБруттоВлажный");
	Движение.ВесНеттоВлажный	= ТранспортировочныеМеста.Итог("ВесНеттоВлажный");
	Движение.Влажность 			= Влажность;
	Движение.МестВПартии		= ТранспортировочныеМеста.Количество();
	
	Для Каждого ТекСтрокаТранспортировочныеМеста Из ТранспортировочныеМеста Цикл
		ТрМестоОбъект = ТекСтрокаТранспортировочныеМеста.ТранспортировочноеМесто.ПолучитьОбъект();
		ИДТранспортировочногоМеста = Партия.Код + "."+Формат(ТекСтрокаТранспортировочныеМеста.НомерМестаВПартии,"ЧЦ=3; ЧВН=") + "."+Формат(ТекСтрокаТранспортировочныеМеста.ВесБруттоВлажный,"ЧЦ=4; ЧДЦ=0; ЧВН=; ЧГ=0");
		ИДТранспортировочногоМеста1 = Партия.Код + "."+Формат(ТекСтрокаТранспортировочныеМеста.НомерМестаВПартии,"ЧЦ=3; ЧВН=");
		
		ТрМестоОбъект.ИдентификаторТранспортировочногоМеста = ИДТранспортировочногоМеста;
		ТрМестоОбъект.ИдентификаторТранспортировочногоМеста1 = ИДТранспортировочногоМеста1;
		Попытка
			ТрМестоОбъект.Заблокировать();
			ТрМестоОбъект.ОбменДанными.Загрузка = Истина;
			ТрМестоОбъект.Записать();
		Исключение	
			ТекстСообщения = "Не удалось заблокировать транспортировочное место из строки № "+ ТекСтрокаТранспортировочныеМеста.НомерСтроки;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "", "Объект", Отказ);
			Отказ = Истина;	
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Для Каждого ТекСтрокаТранспортировочныеМеста Из ТранспортировочныеМеста Цикл
		ТрМестоОбъект = ТекСтрокаТранспортировочныеМеста.ТранспортировочноеМесто.ПолучитьОбъект();
		ТрМестоОбъект.ИдентификаторТранспортировочногоМеста = "";
		ТрМестоОбъект.ИдентификаторТранспортировочногоМеста1 = "";
		Попытка
			ТрМестоОбъект.Заблокировать();
			ТрМестоОбъект.ОбменДанными.Загрузка = Истина;
			ТрМестоОбъект.Записать();
		Исключение	
			ТекстСообщения = "Не удалось заблокировать транспортировочное место из строки № "+ ТекСтрокаТранспортировочныеМеста.НомерСтроки;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "", "Объект", Отказ);
			Отказ = Истина;	
		КонецПопытки;
		
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Партия.ОбщийВесБруттоПартииВлажный <>  ТранспортировочныеМеста.Итог("ВесБруттоВлажный") Тогда 
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Общий вес продукции, указанный в партии не соответствует весу продукции
								|упакованному в транспортировочные места.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "", "Объект", Отказ);
	КонецЕсли;
	
	Если Партия.ОбщийВесНеттоПартииВлажный <>  ТранспортировочныеМеста.Итог("ВесНеттоВлажный") Тогда 
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Общий вес нетто продукции, указанный в партии не соответствует весу нетто продукции
								|упакованному в транспортировочные места.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "", "Объект", Отказ);
	КонецЕсли;
	
	Если НачалоДня(Дата) <> НачалоДня(Партия.ДатаВыпуска) Тогда 
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Дата выпуска партии продукции отличается от даты документа.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "", "Объект", Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию(ПараметрыСеанса.ТекущийПользователь.Наименование);
	Склад = Справочники.Склады.СкладПоУмолчанию(ПараметрыСеанса.ТекущийПользователь.Наименование);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры
